apache/nuttx/boards/arm/sam34/sam4e-ek/src/sam_ili9341.c
static struct sam_dev_s g_lcddev =
{
  .dev =
  {
    /* LCD Configuration */

    .getvideoinfo = sam_getvideoinfo,
    .getplaneinfo = sam_getplaneinfo,

    /* LCD RGB Mapping -- Not supported */

    /* Cursor Controls -- Not supported */

    /* LCD Specific Controls */

    .getpower     = sam_getpower,
    .setpower     = sam_setpower,
    .getcontrast  = sam_getcontrast,
    .setcontrast  = sam_setcontrast,
  },
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name:  sam_putreg
 *
 * Description:
 *   Write to a multi-byte ILI9341 register
 *
 ****************************************************************************/

static void sam_putreg(uint8_t regaddr, const uint8_t *buffer,
                       unsigned int buflen)
{
  LCD_INDEX = 0;
  LCD_INDEX = regaddr;

  /* Write the multi-byte register value */

  for (; buflen > 0; buflen--)
    {
      LCD_DATA = *buffer++;
    }
}

/****************************************************************************
 * Name:  sam_getreg
 *
 * Description:
 *   Read from a multi-byte ILI9341 register
 *
 ****************************************************************************/

static void sam_getreg(uint8_t regaddr, uint8_t *buffer,
                       unsigned int buflen)
{
  LCD_INDEX = 0;
  LCD_INDEX = regaddr;

  /* Read the multi-byte register value */

  for (; buflen > 0; buflen--)
    {
      *buffer++ = LCD_DATA;
    }
}

/****************************************************************************
 * Name:  sam_setwindow
 *
 * Description:
 *   Setup drawing window
 *
 ****************************************************************************/

static void sam_setwindow(sam_color_t row, sam_color_t col,
                          sam_color_t width, sam_color_t height)
{
  uint8_t buffer[4];

  lcdinfo("row=%d col=%d width=%d height=%d\n", row, col, width, height);

  /* Set Column Address Position */

  buffer[0] = (col >> 8) & 0xff;
  buffer[1] = col & 0xff;
  buffer[2] = ((col + width - 1) >> 8) & 0xff;
  buffer[3] = (col + width - 1) & 0xff;
  sam_putreg(ILI9341_COLUMN_ADDRESS_SET, buffer, 4);

  /* Set Page Address Position */

  buffer[0] = (row >> 8) & 0xff;
  buffer[1] = row & 0xff;
  buffer[2] = ((row + height - 1) >> 8) & 0xff;
  buffer[3] = (row + height - 1) & 0xff;
  sam_putreg(ILI9341_PAGE_ADDRESS_SET, buffer, 4);
}

/****************************************************************************
 * Name:  sam_gram_wrprepare
 *
 * Description:
 *   Setup to write multiple pixels to the GRAM memory
 *
 ****************************************************************************/

static inline void sam_gram_wrprepare(void)
{
  /* Memory write command */

  LCD_INDEX = ILI9341_MEMORY_WRITE;
  LCD_INDEX = 0;
  LCD_INDEX = ILI9341_WRITE_MEMORY_CONTINUE;
}

/****************************************************************************
 * Name:  sam_gram_rdprepare
 *
 * Description:
 *   Setup to read multiple pixels from the GRAM memory
 *
 ****************************************************************************/

static inline void sam_gram_rdprepare(void)
{
  /* Write Data to GRAM */

  LCD_INDEX = 0;
  LCD_INDEX = ILI9341_MEMORY_READ;
}

/****************************************************************************
 * Name:  sam_gram_write
 *
 * Description:
 *   Write one pixel to the GRAM memory
 *
 ****************************************************************************/

static inline void sam_gram_write(sam_color_t color)
{
  LCD_DATA = RGB_RED(color);
  LCD_DATA = RGB_GREEN(color);
  LCD_DATA = RGB_BLUE(color);
}

/****************************************************************************
 * Name:  sam_gram_read
 *
 * Description:
 *   Read one 16-bit pixel to the GRAM memory
 *
 ****************************************************************************/

static inline sam_color_t sam_gram_read(void)
{
  uint8_t buffer[3];

  buffer[0] = LCD_DATA;       /* Dummy read */
  buffer[0] = LCD_DATA;       /* R */
  buffer[1] = LCD_DATA;       /* G */
  buffer[2] = LCD_DATA;       /* B */

  /* Return the converted color */

  return RGB_COLOR((sam_color_t)buffer[0], (sam_color_t)buffer[1],
                   (sam_color_t)buffer[2]);
}

/****************************************************************************
 * Name:  sam_dumprun
 *
 * Description:
 *   Dump the contexts of the run buffer:
 *
 *  run     - The buffer in containing the run read to be dumped
 *  npixels - The number of pixels to dump
 *
 ****************************************************************************/

#if 0 /* Sometimes useful */
static void sam_dumprun(const char *msg, uint16_t *run,
                        size_t npixels)
{
  int i;
  int j;

  syslog(LOG_DEBUG, "\n%s:\n", msg);
  for (i = 0; i < npixels; i += 16)
    {
      up_putc(' ');
      syslog(LOG_DEBUG, " ");
      for (j = 0; j < 16; j++)
        {
          syslog(LOG_DEBUG, " %04x", *run++);
        }

      up_putc('\n');
    }
}
#endif

/****************************************************************************
 * Name:  sam_disable_backlight
 *
 * Description:
 *   Turn the backlight off.
 *
 ****************************************************************************/

static void sam_disable_backlight(void)
{
  volatile int delay;

  sam_gpiowrite(GPIO_LCD_BKL, false);
  for (delay = 0; delay < BKL_DISABLE_DURATION; delay++);
}

/****************************************************************************
 * Name:  sam_set_backlight
 *
 * Description:
 *   The the backlight to the level associated with the specified power
 *   value.
 *
 ****************************************************************************/

static void sam_set_backlight(unsigned int power)
{
  volatile int delay;
  unsigned int level;
  int i;

  lcdinfo("power=%d\n", power);

