apache/nuttx/boards/arm/sam34/sam4e-ek/src/sam_ili9341.c
      sam_poweroff(priv);
    }

  return OK;
}

/****************************************************************************
 * Name:  sam_getcontrast
 *
 * Description:
 *   Get the current contrast setting (0-CONFIG_LCD_MAXCONTRAST).
 *
 ****************************************************************************/

static int sam_getcontrast(struct lcd_dev_s *dev)
{
  lcdinfo("Not implemented\n");
  return -ENOSYS;
}

/****************************************************************************
 * Name:  sam_setcontrast
 *
 * Description:
 *   Set LCD panel contrast (0-CONFIG_LCD_MAXCONTRAST).
 *
 ****************************************************************************/

static int sam_setcontrast(struct lcd_dev_s *dev, unsigned int contrast)
{
  lcdinfo("contrast: %d\n", contrast);
  return -ENOSYS;
}

/****************************************************************************
 * Name:  sam_gpio_initialize
 *
 * Description:
 *   Configure LCD GPIO pins
 *
 ****************************************************************************/

static inline void sam_gpio_initialize(void)
{
  int i;

  /* Configure all LCD pins pins (backlight is initially off) */

  for (i = 0; i < LCD_NPINS; i++)
    {
      sam_configgpio(g_lcdpin[i]);
    }
}

/****************************************************************************
 * Name:  sam_smc_initialize
 *
 * Description:
 *   Configure LCD SMC interface
 *
 ****************************************************************************/

static inline void sam_smc_initialize(void)
{
  uintptr_t smcbase =  SAM_SMCCS_BASE(SAM_LCD_CS);
  uint32_t regval;

  /* Configure SMC interface for the LCD */

  regval = SMCCS_SETUP_NWESETUP(2) | SMCCS_SETUP_NCSWRSETUP(2) |
           SMCCS_SETUP_NRDSETUP(2) | SMCCS_SETUP_NCSRDSETUP(2);
  putreg32(regval, smcbase + SAM_SMCCS_SETUP_OFFSET);

  regval = SMCCS_PULSE_NWEPULSE(4)  | SMCCS_PULSE_NCSWRPULSE(4) |
           SMCCS_PULSE_NRDPULSE(10) | SMCCS_PULSE_NCSRDPULSE(10);
  putreg32(regval, smcbase + SAM_SMCCS_PULSE_OFFSET);

  regval = SMCCS_CYCLE_NWECYCLE(10) | SMCCS_CYCLE_NRDCYCLE(22);
  putreg32(regval, smcbase + SAM_SMCCS_CYCLE_OFFSET);

#ifdef SMCCS_MODE_DBW_8BITS /* SAM3U, SAM3X, SAM3A */
  regval = SMCCS_MODE_READMODE | SMCCS_MODE_WRITEMODE | SMCCS_MODE_DBW_8BITS;
#else
  regval = SMCCS_MODE_READMODE | SMCCS_MODE_WRITEMODE;
#endif
  putreg32(regval, smcbase + SAM_SMCCS_MODE_OFFSET);
}

/****************************************************************************
 * Name:  sam_lcd9341_initialize
 *
 * Description:
 *   Initialize the ILI9341 LCD.
 *
 ****************************************************************************/

static void sam_lcd9341_initialize(void)
{
  uint8_t buffer[5];

  /* Power control A configuration */

  buffer[0] = 0x39;
  buffer[1] = 0x2c;
  buffer[2] = 0x00;
  buffer[3] = 0x34;
  buffer[4] = 0x02;
  sam_putreg(ILI9341_POWER_CONTROL_A, buffer, 5);

  /* Power control B configuration */

  buffer[0] = 0x00;
  buffer[1] = 0xaa;
  buffer[2] = 0xb0;
  sam_putreg(ILI9341_POWER_CONTROL_B, buffer, 3);

  /* Pump Ratio Control configuration */

  buffer[0] = 0x30;
  sam_putreg(ILI9341_PUMP_RATIO_CONTROL, buffer, 1);

  /* Power Control 1 configuration */

  buffer[0] = 0x25;
  sam_putreg(ILI9341_POWER_CONTROL_1, buffer, 1);

  /* Power Control 2 configuration */

  buffer[0] = 0x11;
  sam_putreg(ILI9341_POWER_CONTROL_2, buffer, 1);

  /* VOM Control 1 configuration */

  buffer[0] = 0x5c;
  buffer[1] = 0x4c;
  sam_putreg(ILI9341_VCOM_CONTROL_1, buffer, 2);

  /* VOM control 2 configuration */

  buffer[0] = 0x94;
  sam_putreg(ILI9341_VCOM_CONTROL_2, buffer, 1);

  /* Driver Timing Control A configuration */

  buffer[0] = 0x85;
  buffer[1] = 0x01;
  buffer[2] = 0x78;
  sam_putreg(ILI9341_DRIVER_TIMING_CTL_A, buffer, 3);

  /* Driver Timing Control B configuration */

  buffer[0] = 0x00;
  buffer[1] = 0x00;
  sam_putreg(ILI9341_DRIVER_TIMING_CTL_B, buffer, 2);

  /* Memory Access Control configuration */

#if defined(CONFIG_LCD_LANDSCAPE)
  /* Horizontal refresh order (MH): 0
   * RGB/BGR order (BGR)          : 1
   * Vertical refresh order (ML)  : 0
   * Row/column exchange (MV)     : 1
   * Column address order (MX)    : 0
   * Row address order (MY)       : 1
   */

  buffer[0] = ILI9341_MEMORY_ACCESS_CONTROL_BGR |
              ILI9341_MEMORY_ACCESS_CONTROL_MV;

#elif defined(CONFIG_LCD_PORTRAIT)
  /* Horizontal refresh order (MH): 0
   * RGB/BGR order (BGR)          : 1
   * Vertical refresh order (ML)  : 0
   * Row/column exchange (MV)     : 0
   * Column address order (MX)    : 0
   * Row address order (MY)       : 0
   */

  buffer[0] = ILI9341_MEMORY_ACCESS_CONTROL_BGR;

#elif defined(CONFIG_LCD_RLANDSCAPE)
  /* Horizontal refresh order (MH): 0
   * RGB/BGR order (BGR)          : 1
   * Vertical refresh order (ML)  : 0
   * Row/column exchange (MV)     : 1
   * Column address order (MX)    : 1
   * Row address order (MY)       : 0
   */

  buffer[0] = ILI9341_MEMORY_ACCESS_CONTROL_BGR |
              ILI9341_MEMORY_ACCESS_CONTROL_MV |
              ILI9341_MEMORY_ACCESS_CONTROL_MX;

#elif defined(CONFIG_LCD_RPORTRAIT)
  /* Horizontal refresh order (MH): 0
   * RGB/BGR order (BGR)          : 1
   * Vertical refresh order (ML)  : 0
   * Row/column exchange (MV)     : 1
   * Column address order (MX)    : 0
   * Row address order (MY)       : 1
   */

  buffer[0] = ILI9341_MEMORY_ACCESS_CONTROL_BGR |
              ILI9341_MEMORY_ACCESS_CONTROL_MX |
              ILI9341_MEMORY_ACCESS_CONTROL_MY;

#endif

  sam_putreg(ILI9341_MEMORY_ACCESS_CONTROL, buffer, 1);

  /* Colmod Pixel Format Set configuration */

  buffer[0] = 0x06;
  sam_putreg(ILI9341_PIXEL_FORMAT_SET, buffer, 1);

  /* Display Function Control */

  buffer[0] = 0x02;
  buffer[1] = 0x82;
  buffer[2] = 0x27;
  buffer[3] = 0x00;
  sam_putreg(ILI9341_DISPLAY_FUNCTION_CTL, buffer, 4);

  /* Set window area */

  sam_setwindow(0, 0, SAM_XRES, SAM_YRES);

  /* Leave sleep mode */

  sam_putreg(ILI9341_SLEEP_OUT, buffer, 0);
  up_mdelay(10);

  /* Initial state: LCD off */

  sam_putreg(ILI9341_DISPLAY_OFF, buffer, 0);
}

/****************************************************************************
 * Name:  sam_lcd_initialize
 *
 * Description:
 *   Initialize the LCD panel
 *
 ****************************************************************************/

